Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoint Method
Overload List
Name | Description
PickPoint(String)
 Requests the user to pick one point. Returns the picked point in the view coordinates and the view in which the pick occurred.
PickPoint(String, Point, ViewBase)
 Requests the user to pick one point.
Top
See Also
Reference
Picker Class
Tekla.Structures.Drawing.UI Namespace